app/controllers/users_controller.rb

SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` LIMIT 30 OFFSET 0
---
  def index
    @title = "All users"
    @users = User.paginate(:page => params[:page])