app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
---
  def show
    @user = User.find(params[:id])

SELECT `users`.* FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
---
  def edit
    @user = User.find(params[:id])

INSERT INTO `users` (`email`, `encrypted_password`, `updated_at`, `salt`, `name`, `created_at`) VALUES ('bfhair02@gmail.com', '3ecd94a4e6275e107a9ca7cda93f2b139f4e78e4876691ecf28d81adf6a87be9', '2011-06-17 10:33:14', '43d606b45385c99b3f07b264c7ae90361e7fa4d7af578d8aaefc8908bdb7d783', 'Paul Indrekson', '2011-06-17 10:33:14')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 3) LIMIT 1
UPDATE `users` SET `updated_at` = '2011-06-05 15:45:12', `email` = 'sdfsdf@gmail.com' WHERE (`users`.`id` = 3)
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
DELETE FROM `users` WHERE (`users`.`id` = 6)
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy